web_app/app/views/users/show.html.erb

    <ul class="nav nav-tabs nav-justified">
      <% @user.profiles.each do |profile| %>
---
SELECT `profiles`.* FROM `profiles` WHERE `profiles`.`user_id` = 1