web_app/app/controllers/boards_controller.rb

  def index
    @boards = Board.order(id: :desc).page(params[:page]).per(10)
    @game = Game.find(params[:game_id])
---
SELECT  `boards`.* FROM `boards` ORDER BY `boards`.`id` DESC LIMIT 10 OFFSET 0
SELECT  `games`.* FROM `games` WHERE `games`.`id` = 1 LIMIT 1

  def new
    @board = Board.new
    @game = Game.find(params[:game_id])
---
SELECT  `games`.* FROM `games` WHERE `games`.`id` = 1 LIMIT 1

  def create
    @board = Board.new(board_params)

    if @board.save
---
INSERT INTO `boards` (`target_rank`, `recruit_number`, `content`, `created_at`, `updated_at`, `game_id`, `user_id`) VALUES ('マスター', 2, 'ガチ勢求む。', '2023-04-05 08:46:30', '2023-04-05 08:46:30', 1, 1)

    def set_board
      @board = Board.find_by(id: params[:id])
---
SELECT  `boards`.* FROM `boards` WHERE `boards`.`id` = 1 LIMIT 1