web_app/app/views/parties/_join_button.html.erb

SELECT  `parties`.* FROM `parties` WHERE `parties`.`join_id` = 3 AND `parties`.`board_id` = 1 LIMIT 1
---
  <% if current_user.joining?(board) %>
    <%= form_with(model: current_user.parties.find_by(board_id: board.id), local: true, method: :delete) do |f| %>