app/controllers/games_controller.rb

  def index
    @games = Game.all
---
SELECT `games`.* FROM `games`

  def create
    @game = Game.new(game_params)
    if @game.save
---
INSERT INTO `games` (`title`, `created_at`, `updated_at`) VALUES ('Apex Legends', '2023-04-05 08:45:07', '2023-04-05 08:45:07')