app/controllers/parties_controller.rb

  def create
    board = Board.find(params[:board_id])
---
SELECT  `boards`.* FROM `boards` WHERE `boards`.`id` = 1 LIMIT 1

  def destroy
    board = Board.find(params[:board_id])
---
SELECT  `boards`.* FROM `boards` WHERE `boards`.`id` = 1 LIMIT 1