app/controllers/profiles_controller.rb

  def create
    @profile = Profile.new(profile_params)

    if @profile.save
---
INSERT INTO `profiles` (`online_code`, `current_rank`, `best_rank`, `frequency`, `enjoy`, `user_id`, `created_at`, `updated_at`, `game_title`, `favorite_character`) VALUES ('admin', 'admin', 'admin', 'admin', '0', 1, '2023-04-05 08:37:24', '2023-04-05 08:37:24', 'admin', 'admin')

  def update
    if @profile.update(profile_params)
---
UPDATE `profiles` SET `game_title` = 'Apex', `current_rank` = 'ダイア3', `best_rank` = 'プレデター', `favorite_character` = 'レイス', `frequency` = '週に1回', `enjoy` = '1', `updated_at` = '2023-04-05 08:38:26' WHERE `profiles`.`id` = 1

    def set_profile
      @profile = Profile.find_by(id: params[:id])
---
SELECT  `profiles`.* FROM `profiles` WHERE `profiles`.`id` = 1 LIMIT 1