app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` ORDER BY `users`.`id` DESC LIMIT 25 OFFSET 0
---
  def index
    @users = User.order(id: :desc).page(params[:page]).per(25)

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    def set_user
      @user = User.find_by(id: params[:id])