app/models/user.rb

INSERT INTO `parties` (`join_id`, `board_id`, `created_at`, `updated_at`) VALUES (3, 1, '2023-04-05 12:02:46', '2023-04-05 12:02:46')
---
  def join(board)
    self.parties.find_or_create_by(board_id: board.id)

SELECT  `parties`.* FROM `parties` WHERE `parties`.`join_id` = 4 AND `parties`.`board_id` = 1 LIMIT 1
DELETE FROM `parties` WHERE `parties`.`id` = 3
---
  def unjoin(board)
    join = self.parties.find_or_create_by(board_id: board.id)
    join.destroy if join